IOTracer_tests/fio_tests/fio_results_userspace_poll
fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=25361: Thu Jun  6 15:22:09 2024
  read: IOPS=28.4k, BW=111MiB/s (116MB/s)(1024MiB/9229msec)
    clat (usec): min=22, max=3775, avg=34.62, stdev=39.46
     lat (usec): min=22, max=3775, avg=34.68, stdev=39.47
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   26], 10.00th=[   26], 20.00th=[   26],
     | 30.00th=[   27], 40.00th=[   27], 50.00th=[   27], 60.00th=[   28],
     | 70.00th=[   29], 80.00th=[   31], 90.00th=[   37], 95.00th=[   83],
     | 99.00th=[  147], 99.50th=[  223], 99.90th=[  570], 99.95th=[  611],
     | 99.99th=[  742]
   bw (  KiB/s): min=96416, max=135856, per=100.00%, avg=113925.78, stdev=11753.97, samples=18
   iops        : min=24104, max=33964, avg=28481.44, stdev=2938.49, samples=18
  lat (usec)   : 50=93.85%, 100=3.41%, 250=2.32%, 500=0.20%, 750=0.21%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=2.67%, sys=33.93%, ctx=262224, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=111MiB/s (116MB/s), 111MiB/s-111MiB/s (116MB/s-116MB/s), io=1024MiB (1074MB), run=9229-9229msec

-------------------------------------------------------------------

fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=25382: Thu Jun  6 15:22:19 2024
  read: IOPS=27.6k, BW=108MiB/s (113MB/s)(1024MiB/9493msec)
    clat (usec): min=22, max=4619, avg=35.54, stdev=42.49
     lat (usec): min=22, max=4619, avg=35.63, stdev=42.52
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   26], 10.00th=[   26], 20.00th=[   27],
     | 30.00th=[   27], 40.00th=[   27], 50.00th=[   28], 60.00th=[   29],
     | 70.00th=[   30], 80.00th=[   34], 90.00th=[   38], 95.00th=[   84],
     | 99.00th=[  149], 99.50th=[  225], 99.90th=[  578], 99.95th=[  619],
     | 99.99th=[  955]
   bw (  KiB/s): min=85560, max=128920, per=100.00%, avg=111086.67, stdev=13884.80, samples=18
   iops        : min=21390, max=32230, avg=27771.67, stdev=3471.20, samples=18
  lat (usec)   : 50=93.56%, 100=3.58%, 250=2.42%, 500=0.21%, 750=0.22%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=3.18%, sys=34.22%, ctx=262260, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=108MiB/s (113MB/s), 108MiB/s-108MiB/s (113MB/s-113MB/s), io=1024MiB (1074MB), run=9493-9493msec

-------------------------------------------------------------------

fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=25412: Thu Jun  6 15:22:29 2024
  read: IOPS=27.9k, BW=109MiB/s (114MB/s)(1024MiB/9384msec)
    clat (usec): min=23, max=4230, avg=35.21, stdev=39.32
     lat (usec): min=23, max=4230, avg=35.28, stdev=39.41
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   26], 10.00th=[   27], 20.00th=[   27],
     | 30.00th=[   27], 40.00th=[   28], 50.00th=[   28], 60.00th=[   29],
     | 70.00th=[   30], 80.00th=[   32], 90.00th=[   38], 95.00th=[   81],
     | 99.00th=[  149], 99.50th=[  221], 99.90th=[  570], 99.95th=[  611],
     | 99.99th=[  758]
   bw (  KiB/s): min=99648, max=130680, per=100.00%, avg=112193.78, stdev=10840.15, samples=18
   iops        : min=24912, max=32670, avg=28048.44, stdev=2710.04, samples=18
  lat (usec)   : 50=93.87%, 100=3.41%, 250=2.31%, 500=0.19%, 750=0.21%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.61%, sys=34.80%, ctx=262195, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=109MiB/s (114MB/s), 109MiB/s-109MiB/s (114MB/s-114MB/s), io=1024MiB (1074MB), run=9384-9384msec

-------------------------------------------------------------------

fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=25430: Thu Jun  6 15:22:39 2024
  read: IOPS=28.0k, BW=109MiB/s (115MB/s)(1024MiB/9361msec)
    clat (usec): min=22, max=12387, avg=35.16, stdev=47.19
     lat (usec): min=22, max=12387, avg=35.22, stdev=47.20
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   26], 10.00th=[   27], 20.00th=[   27],
     | 30.00th=[   27], 40.00th=[   28], 50.00th=[   28], 60.00th=[   29],
     | 70.00th=[   30], 80.00th=[   32], 90.00th=[   38], 95.00th=[   82],
     | 99.00th=[  151], 99.50th=[  223], 99.90th=[  578], 99.95th=[  619],
     | 99.99th=[  758]
   bw (  KiB/s): min=98816, max=135816, per=100.00%, avg=112506.22, stdev=11676.59, samples=18
   iops        : min=24704, max=33954, avg=28126.56, stdev=2919.15, samples=18
  lat (usec)   : 50=93.83%, 100=3.38%, 250=2.37%, 500=0.19%, 750=0.21%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=2.82%, sys=34.09%, ctx=262215, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=109MiB/s (115MB/s), 109MiB/s-109MiB/s (115MB/s-115MB/s), io=1024MiB (1074MB), run=9361-9361msec

-------------------------------------------------------------------

fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=25447: Thu Jun  6 15:22:48 2024
  read: IOPS=28.2k, BW=110MiB/s (115MB/s)(1024MiB/9312msec)
    clat (usec): min=22, max=2924, avg=34.96, stdev=38.83
     lat (usec): min=22, max=2925, avg=35.02, stdev=38.84
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   26], 10.00th=[   26], 20.00th=[   27],
     | 30.00th=[   27], 40.00th=[   28], 50.00th=[   28], 60.00th=[   29],
     | 70.00th=[   30], 80.00th=[   32], 90.00th=[   37], 95.00th=[   78],
     | 99.00th=[  147], 99.50th=[  223], 99.90th=[  578], 99.95th=[  619],
     | 99.99th=[  750]
   bw (  KiB/s): min=99632, max=131080, per=100.00%, avg=113003.56, stdev=11321.92, samples=18
   iops        : min=24908, max=32770, avg=28250.89, stdev=2830.48, samples=18
  lat (usec)   : 50=94.08%, 100=3.27%, 250=2.21%, 500=0.21%, 750=0.22%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=2.72%, sys=34.30%, ctx=262219, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=110MiB/s (115MB/s), 110MiB/s-110MiB/s (115MB/s-115MB/s), io=1024MiB (1074MB), run=9312-9312msec

-------------------------------------------------------------------